Revit 2027 API
LightDistribution.Clone Method
 Creates a copy of the LightDistribution derived object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightDistribution Clone()
Public Function Clone As LightDistribution
public:
LightDistribution^ Clone()
member Clone : unit -> LightDistribution
Return Value
LightDistribution
See Also
Reference
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace